const { Events, Interaction, EmbedBuilder } = require("discord.js");
const { Database } = require("st.db");


module.exports = {
  name: Events.InteractionCreate,
  async execute(interaction) {
    if (interaction.isButton()) {
      if (interaction.customId == "showinfo") {
        // التحقق من وجود خيارات الأمر والخيار "user"

       

        // إنشاء EmbedBuilder
        const embedBuilder = new EmbedBuilder()
          .setColor("#0000ff")
          .setTitle(`معلومات  حول اسعار بروجكتات 🌟 ${interaction.guild.name}.`)
     .setDescription(`
     بروجكتات متاحة:
الاسم :بيع تثبيت بل صوت
السعر :500
لاسم :بيع تثبيت بل صوت بدون بانل
السعر :450
الاسم :بيع تلفيل بروبوت
السعر :500
 لاسم :بيع تلفيل بروبوت بدون بانل
السعر :450
الاسم :بروجكت بيع حالة حسابك
السعر :1000
الاسم :بروجكت بيع جعل حسابك اونلاين
السعر :1000
الاسم :بروجكت بيع شارة مطورة
السعر :1000
الاسم :بروجكت بيع بانر
السعر :1000
الاسم :بروجكت بيع اوتو رياكشن
السعر :3000
الاسم :بروجكت بيع نسخ سيرفرات بتوكن
السعر :100
الاسم :بروجكت بيع نسخ سيرفرات بدون توكن
السعر :200
الاسم :بروجكت بيع توكنات بوت
السعر :200
الاسم :بروجكت ميكر مطور
السعر :300
الاسم :بروجكت ميكر كوينز
السعر :500 
الاسم :بروجكت ميكر كوينز داشبورد نفسا يلي كان سيرفر
السعر :3000
لاسم :بروجكت ميكر كوينز بيع ابتايم نفسا يلي كان سيرفر
السعر :5000
الاسم :بروجكت بيع بروجكتات عادي
السعر :100
الاسم :بروجكت بيع بروجكتات مثل هاذ
السعر :500
الاسم :بروجكت شوب مطور
السعر :500
الاسم :بروجكت عروض تكت مطور
السعر :300 
الاسم :بروجكت عروض
السعر :100
الاسم :بروجكت تشفير شوب
السعر :100
الاسم :بروجكت تحذيرات مطور
السعر :100

`);

        // إرسال الرد بشكل جذاب للمتفاعل فقط
        interaction.reply({ embeds: [embedBuilder], ephemeral: true });
      }
    }
  },
};
